AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_mraminfo1.h
//*****************************************************************************
//
//  am_mcu_apollo510l_info1.h
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (c) 2025, Ambiq Micro, Inc.
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision release_sdk5_2_a_1_1-c2486c8ef of the AmbiqSuite Development Package.
//
//*****************************************************************************

#ifndef AM_REG_INFO1_H
#define AM_REG_INFO1_H

#define AM_REG_INFO1_BASEADDR 0x42002000

#define AM_REG_INFO1_SBL_VERSION_0_O 0x00001200
#define AM_REG_INFO1_SBL_VERSION_0_ADDR 0x42003200
#define AM_REG_INFO1_SBL_VERSION_1_O 0x00001204
#define AM_REG_INFO1_SBL_VERSION_1_ADDR 0x42003204
#define AM_REG_INFO1_MAINPTR_O 0x00001210
#define AM_REG_INFO1_MAINPTR_ADDR 0x42003210
#define AM_REG_INFO1_PATCH_TRACKER0_O 0x00001240
#define AM_REG_INFO1_PATCH_TRACKER0_ADDR 0x42003240
#define AM_REG_INFO1_PATCH_TRACKER1_O 0x00001244
#define AM_REG_INFO1_PATCH_TRACKER1_ADDR 0x42003244
#define AM_REG_INFO1_PATCH_TRACKER2_O 0x00001248
#define AM_REG_INFO1_PATCH_TRACKER2_ADDR 0x42003248
#define AM_REG_INFO1_PATCH_TRACKER3_O 0x0000124c
#define AM_REG_INFO1_PATCH_TRACKER3_ADDR 0x4200324c
#define AM_REG_INFO1_SBR_SDCERT_ADDR_O 0x00001250
#define AM_REG_INFO1_SBR_SDCERT_ADDR_ADDR 0x42003250
#define AM_REG_INFO1_SBR_IPT_ADDR_O 0x00001258
#define AM_REG_INFO1_SBR_IPT_ADDR_ADDR 0x42003258
#define AM_REG_INFO1_SBR_OPT_ADDR_O 0x0000125c
#define AM_REG_INFO1_SBR_OPT_ADDR_ADDR 0x4200325c
#define AM_REG_INFO1_TRIM_SBR_OTP_O 0x00001260
#define AM_REG_INFO1_TRIM_SBR_OTP_ADDR 0x42003260
#define AM_REG_INFO1_TEMP_CAL_ATE_O 0x00001300
#define AM_REG_INFO1_TEMP_CAL_ATE_ADDR 0x42003300
#define AM_REG_INFO1_TEMP_CAL_MEASURED_O 0x00001304
#define AM_REG_INFO1_TEMP_CAL_MEASURED_ADDR 0x42003304
#define AM_REG_INFO1_TEMP_CAL_ADC_OFFSET_O 0x00001308
#define AM_REG_INFO1_TEMP_CAL_ADC_OFFSET_ADDR 0x42003308
#define AM_REG_INFO1_CHIPSUBREV_O 0x0000130c
#define AM_REG_INFO1_CHIPSUBREV_ADDR 0x4200330c
#define AM_REG_INFO1_TRIM_REV_O 0x00001310
#define AM_REG_INFO1_TRIM_REV_ADDR 0x42003310
#define AM_REG_INFO1_FT1_GDR1_O 0x00001314
#define AM_REG_INFO1_FT1_GDR1_ADDR 0x42003314
#define AM_REG_INFO1_FT2_GDR1_O 0x00001318
#define AM_REG_INFO1_FT2_GDR1_ADDR 0x42003318
#define AM_REG_INFO1_LVT_TRIMCODE_O 0x0000131c
#define AM_REG_INFO1_LVT_TRIMCODE_ADDR 0x4200331c
#define AM_REG_INFO1_EHVT_TRIMCODE_O 0x00001320
#define AM_REG_INFO1_EHVT_TRIMCODE_ADDR 0x42003320
#define AM_REG_INFO1_ADC_GAIN_ERR_O 0x00001328
#define AM_REG_INFO1_ADC_GAIN_ERR_ADDR 0x42003328
#define AM_REG_INFO1_ADC_OFFSET_ERR_O 0x0000132c
#define AM_REG_INFO1_ADC_OFFSET_ERR_ADDR 0x4200332c
#define AM_REG_INFO1_AUDADC_A0_LG_OFFSET_O 0x00001340
#define AM_REG_INFO1_AUDADC_A0_LG_OFFSET_ADDR 0x42003340
#define AM_REG_INFO1_AUDADC_A0_HG_SLOPE_O 0x00001344
#define AM_REG_INFO1_AUDADC_A0_HG_SLOPE_ADDR 0x42003344
#define AM_REG_INFO1_AUDADC_A0_HG_INTERCEPT_O 0x00001348
#define AM_REG_INFO1_AUDADC_A0_HG_INTERCEPT_ADDR 0x42003348
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_O 0x0000134c
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_ADDR 0x4200334c
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_O 0x00001350
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_ADDR 0x42003350
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_O 0x00001354
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_ADDR 0x42003354
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_O 0x00001358
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_ADDR 0x42003358
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_O 0x0000135c
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_ADDR 0x4200335c
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_O 0x00001360
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_ADDR 0x42003360
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_O 0x00001364
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_ADDR 0x42003364
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_O 0x00001368
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_ADDR 0x42003368
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_O 0x0000136c
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_ADDR 0x4200336c
#define AM_REG_INFO1_RFTRIM_TRIM_VER_O 0x00001370
#define AM_REG_INFO1_RFTRIM_TRIM_VER_ADDR 0x42003370
#define AM_REG_INFO1_RFTRIM_XOCONFIG_O 0x00001374
#define AM_REG_INFO1_RFTRIM_XOCONFIG_ADDR 0x42003374
#define AM_REG_INFO1_RFTRIM_OSCTRIM_O 0x00001378
#define AM_REG_INFO1_RFTRIM_OSCTRIM_ADDR 0x42003378
#define AM_REG_INFO1_RFTRIM_RADIOTUNE_O 0x0000137c
#define AM_REG_INFO1_RFTRIM_RADIOTUNE_ADDR 0x4200337c
#define AM_REG_INFO1_EXTIMGTYPE0_O 0x00001400
#define AM_REG_INFO1_EXTIMGTYPE0_ADDR 0x42003400
#define AM_REG_INFO1_EXTIMGVERSION0_O 0x00001404
#define AM_REG_INFO1_EXTIMGVERSION0_ADDR 0x42003404
#define AM_REG_INFO1_EXTIMGSTARTADDR0_O 0x00001408
#define AM_REG_INFO1_EXTIMGSTARTADDR0_ADDR 0x42003408
#define AM_REG_INFO1_EXTIMGENDADDR0_O 0x0000140c
#define AM_REG_INFO1_EXTIMGENDADDR0_ADDR 0x4200340c
#define AM_REG_INFO1_EXTIMGTYPE1_O 0x00001410
#define AM_REG_INFO1_EXTIMGTYPE1_ADDR 0x42003410
#define AM_REG_INFO1_EXTIMGVERSION1_O 0x00001414
#define AM_REG_INFO1_EXTIMGVERSION1_ADDR 0x42003414
#define AM_REG_INFO1_EXTIMGSTARTADDR1_O 0x00001418
#define AM_REG_INFO1_EXTIMGSTARTADDR1_ADDR 0x42003418
#define AM_REG_INFO1_EXTIMGENDADDR1_O 0x0000141c
#define AM_REG_INFO1_EXTIMGENDADDR1_ADDR 0x4200341c
#define AM_REG_INFO1_EXTIMGTYPE2_O 0x00001420
#define AM_REG_INFO1_EXTIMGTYPE2_ADDR 0x42003420
#define AM_REG_INFO1_EXTIMGVERSION2_O 0x00001424
#define AM_REG_INFO1_EXTIMGVERSION2_ADDR 0x42003424
#define AM_REG_INFO1_EXTIMGSTARTADDR2_O 0x00001428
#define AM_REG_INFO1_EXTIMGSTARTADDR2_ADDR 0x42003428
#define AM_REG_INFO1_EXTIMGENDADDR2_O 0x0000142c
#define AM_REG_INFO1_EXTIMGENDADDR2_ADDR 0x4200342c
#define AM_REG_INFO1_EXTIMGTYPE3_O 0x00001430
#define AM_REG_INFO1_EXTIMGTYPE3_ADDR 0x42003430
#define AM_REG_INFO1_EXTIMGVERSION3_O 0x00001434
#define AM_REG_INFO1_EXTIMGVERSION3_ADDR 0x42003434
#define AM_REG_INFO1_EXTIMGSTARTADDR3_O 0x00001438
#define AM_REG_INFO1_EXTIMGSTARTADDR3_ADDR 0x42003438
#define AM_REG_INFO1_EXTIMGENDADDR3_O 0x0000143c
#define AM_REG_INFO1_EXTIMGENDADDR3_ADDR 0x4200343c
#define AM_REG_INFO1_POWERSTATE0_O 0x00001450
#define AM_REG_INFO1_POWERSTATE0_ADDR 0x42003450
#define AM_REG_INFO1_SCM_CNTRCTRL2_O 0x00001454
#define AM_REG_INFO1_SCM_CNTRCTRL2_ADDR 0x42003454
#define AM_REG_INFO1_SCM_LPTHRESHVDDS_O 0x00001458
#define AM_REG_INFO1_SCM_LPTHRESHVDDS_ADDR 0x42003458
#define AM_REG_INFO1_SCM_LPTHRESHVDDF_O 0x0000145c
#define AM_REG_INFO1_SCM_LPTHRESHVDDF_ADDR 0x4200345c
#define AM_REG_INFO1_SCM_LPTHRESHVDDC_O 0x00001460
#define AM_REG_INFO1_SCM_LPTHRESHVDDC_ADDR 0x42003460
#define AM_REG_INFO1_SCM_LPTHRESHVDDCLV_O 0x00001464
#define AM_REG_INFO1_SCM_LPTHRESHVDDCLV_ADDR 0x42003464
#define AM_REG_INFO1_SCM_LPTHRESHVDDRF_O 0x00001468
#define AM_REG_INFO1_SCM_LPTHRESHVDDRF_ADDR 0x42003468
#define AM_REG_INFO1_SCM_LPHYSTCNT_O 0x0000146c
#define AM_REG_INFO1_SCM_LPHYSTCNT_ADDR 0x4200346c
#define AM_REG_INFO1_SCM_ACTTHRESH1_O 0x00001470
#define AM_REG_INFO1_SCM_ACTTHRESH1_ADDR 0x42003470
#define AM_REG_INFO1_SCM_ACTTHRESH2_O 0x00001474
#define AM_REG_INFO1_SCM_ACTTHRESH2_ADDR 0x42003474
#define AM_REG_INFO1_SCM_ACTTHRESH3_O 0x00001478
#define AM_REG_INFO1_SCM_ACTTHRESH3_ADDR 0x42003478

// SBL_VERSION_0 - Contains the SBL Version number encoding.
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_S 0
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_M 0xFFFFFFFF
#define AM_REG_INFO1_SBL_VERSION_0_VERSION(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_Pos 0
#define AM_REG_INFO1_SBL_VERSION_0_VERSION_Msk 0xFFFFFFFF

// SBL_VERSION_1 - Contains the SBL date code encoding.
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_S 0
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_M 0xFFFFFFFF
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_Pos 0
#define AM_REG_INFO1_SBL_VERSION_1_DATECODE_Msk 0xFFFFFFFF

// MAINPTR - The location of the vector table of the main program. This value is read-only.
#define AM_REG_INFO1_MAINPTR_ADDRESS_S 0
#define AM_REG_INFO1_MAINPTR_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_MAINPTR_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_MAINPTR_ADDRESS_Pos 0
#define AM_REG_INFO1_MAINPTR_ADDRESS_Msk 0xFFFFFFFF

// PATCH_TRACKER0 - Apollo510 family SBL patch tracking [31:0]
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_S 0
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_M 0xFFFFFFFF
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_Pos 0
#define AM_REG_INFO1_PATCH_TRACKER0_RSVD0_Msk 0xFFFFFFFF

// PATCH_TRACKER1 - Apollo510 family SBL patch tracking [63:32]
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_S 0
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_M 0xFFFFFFFF
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_Pos 0
#define AM_REG_INFO1_PATCH_TRACKER1_RSVD1_Msk 0xFFFFFFFF

// PATCH_TRACKER2 - Apollo510 family SBL patch tracking [95:64]
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_S 0
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_M 0xFFFFFFFF
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_Pos 0
#define AM_REG_INFO1_PATCH_TRACKER2_RSVD2_Msk 0xFFFFFFFF

