AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_mraminfo1.h
// AUDADC_A1_LG_OFFSET - This is the float value for low gain offset (less than 12dB). A1 maps to Slot 1
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_A1_HG_SLOPE - This is the float value for high gain slope (more than 12dB). A1 maps to Slot 1
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_A1_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). A1 maps to Slot 1
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// AUDADC_B0_LG_OFFSET - This is the float value for low gain offset (less than 12dB). B0 maps to Slot 2
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_B0_HG_SLOPE - This is the float value for high gain slope (more than 12dB). B0 maps to Slot 2
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_B0_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). B0 maps to Slot 2
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// AUDADC_B1_LG_OFFSET - This is the float value for low gain offset (less than 12dB). B1 maps to Slot 3
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_B1_HG_SLOPE - This is the float value for high gain slope (more than 12dB). B1 maps to Slot 3
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_B1_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). B1 maps to Slot 3
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// RFTRIM_TRIM_VER - Radio trim version
#define AM_REG_INFO1_RFTRIM_TRIM_VER_VERSION_S 0
#define AM_REG_INFO1_RFTRIM_TRIM_VER_VERSION_M 0xFFFFFFFF
#define AM_REG_INFO1_RFTRIM_TRIM_VER_VERSION(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_RFTRIM_TRIM_VER_VERSION_Pos 0
#define AM_REG_INFO1_RFTRIM_TRIM_VER_VERSION_Msk 0xFFFFFFFF

// RFTRIM_XOCONFIG - RF trim XO configuration
#define AM_REG_INFO1_RFTRIM_XOCONFIG_CFG_S 0
#define AM_REG_INFO1_RFTRIM_XOCONFIG_CFG_M 0xFFFFFFFF
#define AM_REG_INFO1_RFTRIM_XOCONFIG_CFG(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_RFTRIM_XOCONFIG_CFG_Pos 0
#define AM_REG_INFO1_RFTRIM_XOCONFIG_CFG_Msk 0xFFFFFFFF

// RFTRIM_OSCTRIM - RF trim oscillator trim
#define AM_REG_INFO1_RFTRIM_OSCTRIM_TRIM_S 0
#define AM_REG_INFO1_RFTRIM_OSCTRIM_TRIM_M 0xFFFFFFFF
#define AM_REG_INFO1_RFTRIM_OSCTRIM_TRIM(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_RFTRIM_OSCTRIM_TRIM_Pos 0
#define AM_REG_INFO1_RFTRIM_OSCTRIM_TRIM_Msk 0xFFFFFFFF

// RFTRIM_RADIOTUNE - Radio trim radio tune value
#define AM_REG_INFO1_RFTRIM_RADIOTUNE_TRIM_S 0
#define AM_REG_INFO1_RFTRIM_RADIOTUNE_TRIM_M 0xFFFFFFFF
#define AM_REG_INFO1_RFTRIM_RADIOTUNE_TRIM(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_RFTRIM_RADIOTUNE_TRIM_Pos 0
#define AM_REG_INFO1_RFTRIM_RADIOTUNE_TRIM_Msk 0xFFFFFFFF

// EXTIMGTYPE0 - This register contains the type of the extended image type identifier.
#define AM_REG_INFO1_EXTIMGTYPE0_CM4IMAGE_S 16
#define AM_REG_INFO1_EXTIMGTYPE0_CM4IMAGE_M 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE0_CM4IMAGE(n) (((uint32_t)(n) << 16) & 0x00010000)
#define AM_REG_INFO1_EXTIMGTYPE0_CM4IMAGE_Pos 16
#define AM_REG_INFO1_EXTIMGTYPE0_CM4IMAGE_Msk 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE0_TYPE_S 8
#define AM_REG_INFO1_EXTIMGTYPE0_TYPE_M 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE0_TYPE(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO1_EXTIMGTYPE0_TYPE_Pos 8
#define AM_REG_INFO1_EXTIMGTYPE0_TYPE_Msk 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE0_SUBTYPE_S 0
#define AM_REG_INFO1_EXTIMGTYPE0_SUBTYPE_M 0x000000FF
#define AM_REG_INFO1_EXTIMGTYPE0_SUBTYPE(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFO1_EXTIMGTYPE0_SUBTYPE_Pos 0
#define AM_REG_INFO1_EXTIMGTYPE0_SUBTYPE_Msk 0x000000FF

// EXTIMGVERSION0 - Version number of the installed software image 0.
#define AM_REG_INFO1_EXTIMGVERSION0_VERMAJOR_S 24
#define AM_REG_INFO1_EXTIMGVERSION0_VERMAJOR_M 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION0_VERMAJOR(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO1_EXTIMGVERSION0_VERMAJOR_Pos 24
#define AM_REG_INFO1_EXTIMGVERSION0_VERMAJOR_Msk 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION0_VERMINOR_S 16
#define AM_REG_INFO1_EXTIMGVERSION0_VERMINOR_M 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION0_VERMINOR(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO1_EXTIMGVERSION0_VERMINOR_Pos 16
#define AM_REG_INFO1_EXTIMGVERSION0_VERMINOR_Msk 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION0_VERBLD_S 0
#define AM_REG_INFO1_EXTIMGVERSION0_VERBLD_M 0x0000FFFF
#define AM_REG_INFO1_EXTIMGVERSION0_VERBLD(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_INFO1_EXTIMGVERSION0_VERBLD_Pos 0
#define AM_REG_INFO1_EXTIMGVERSION0_VERBLD_Msk 0x0000FFFF

// EXTIMGSTARTADDR0 - This register contains the starting address of the validated extended software image 0.
#define AM_REG_INFO1_EXTIMGSTARTADDR0_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGSTARTADDR0_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGSTARTADDR0_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGSTARTADDR0_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGSTARTADDR0_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGENDADDR0 - This register contains the ending address of the validated extended software image 0.
#define AM_REG_INFO1_EXTIMGENDADDR0_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGENDADDR0_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGENDADDR0_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGENDADDR0_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGENDADDR0_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGTYPE1 - This register contains the type of the validated extended software image 1.
#define AM_REG_INFO1_EXTIMGTYPE1_CM4IMAGE_S 16
#define AM_REG_INFO1_EXTIMGTYPE1_CM4IMAGE_M 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE1_CM4IMAGE(n) (((uint32_t)(n) << 16) & 0x00010000)
#define AM_REG_INFO1_EXTIMGTYPE1_CM4IMAGE_Pos 16
#define AM_REG_INFO1_EXTIMGTYPE1_CM4IMAGE_Msk 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE1_TYPE_S 8
#define AM_REG_INFO1_EXTIMGTYPE1_TYPE_M 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE1_TYPE(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO1_EXTIMGTYPE1_TYPE_Pos 8
#define AM_REG_INFO1_EXTIMGTYPE1_TYPE_Msk 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE1_SUBTYPE_S 0
#define AM_REG_INFO1_EXTIMGTYPE1_SUBTYPE_M 0x000000FF
#define AM_REG_INFO1_EXTIMGTYPE1_SUBTYPE(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFO1_EXTIMGTYPE1_SUBTYPE_Pos 0
#define AM_REG_INFO1_EXTIMGTYPE1_SUBTYPE_Msk 0x000000FF

// EXTIMGVERSION1 - Version number of the installed software image 1.
#define AM_REG_INFO1_EXTIMGVERSION1_VERMAJOR_S 24
#define AM_REG_INFO1_EXTIMGVERSION1_VERMAJOR_M 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION1_VERMAJOR(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO1_EXTIMGVERSION1_VERMAJOR_Pos 24
#define AM_REG_INFO1_EXTIMGVERSION1_VERMAJOR_Msk 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION1_VERMINOR_S 16
#define AM_REG_INFO1_EXTIMGVERSION1_VERMINOR_M 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION1_VERMINOR(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO1_EXTIMGVERSION1_VERMINOR_Pos 16
#define AM_REG_INFO1_EXTIMGVERSION1_VERMINOR_Msk 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION1_VERBLD_S 0
#define AM_REG_INFO1_EXTIMGVERSION1_VERBLD_M 0x0000FFFF
#define AM_REG_INFO1_EXTIMGVERSION1_VERBLD(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_INFO1_EXTIMGVERSION1_VERBLD_Pos 0
#define AM_REG_INFO1_EXTIMGVERSION1_VERBLD_Msk 0x0000FFFF

// EXTIMGSTARTADDR1 - This register contains the starting address of the validated extended software image 1.
#define AM_REG_INFO1_EXTIMGSTARTADDR1_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGSTARTADDR1_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGSTARTADDR1_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGSTARTADDR1_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGSTARTADDR1_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGENDADDR1 - This register contains the ending address of the validated extended software image 1.
#define AM_REG_INFO1_EXTIMGENDADDR1_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGENDADDR1_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGENDADDR1_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGENDADDR1_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGENDADDR1_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGTYPE2 - This register contains the type of the validated extended software image 2.
#define AM_REG_INFO1_EXTIMGTYPE2_CM4IMAGE_S 16
#define AM_REG_INFO1_EXTIMGTYPE2_CM4IMAGE_M 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE2_CM4IMAGE(n) (((uint32_t)(n) << 16) & 0x00010000)
#define AM_REG_INFO1_EXTIMGTYPE2_CM4IMAGE_Pos 16
#define AM_REG_INFO1_EXTIMGTYPE2_CM4IMAGE_Msk 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE2_TYPE_S 8
#define AM_REG_INFO1_EXTIMGTYPE2_TYPE_M 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE2_TYPE(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO1_EXTIMGTYPE2_TYPE_Pos 8
#define AM_REG_INFO1_EXTIMGTYPE2_TYPE_Msk 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE2_SUBTYPE_S 0
#define AM_REG_INFO1_EXTIMGTYPE2_SUBTYPE_M 0x000000FF
#define AM_REG_INFO1_EXTIMGTYPE2_SUBTYPE(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFO1_EXTIMGTYPE2_SUBTYPE_Pos 0
#define AM_REG_INFO1_EXTIMGTYPE2_SUBTYPE_Msk 0x000000FF

// EXTIMGVERSION2 - Version number of the installed software image 2.
#define AM_REG_INFO1_EXTIMGVERSION2_VERMAJOR_S 24
#define AM_REG_INFO1_EXTIMGVERSION2_VERMAJOR_M 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION2_VERMAJOR(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO1_EXTIMGVERSION2_VERMAJOR_Pos 24
#define AM_REG_INFO1_EXTIMGVERSION2_VERMAJOR_Msk 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION2_VERMINOR_S 16
#define AM_REG_INFO1_EXTIMGVERSION2_VERMINOR_M 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION2_VERMINOR(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO1_EXTIMGVERSION2_VERMINOR_Pos 16
#define AM_REG_INFO1_EXTIMGVERSION2_VERMINOR_Msk 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION2_VERBLD_S 0
#define AM_REG_INFO1_EXTIMGVERSION2_VERBLD_M 0x0000FFFF
#define AM_REG_INFO1_EXTIMGVERSION2_VERBLD(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_INFO1_EXTIMGVERSION2_VERBLD_Pos 0
#define AM_REG_INFO1_EXTIMGVERSION2_VERBLD_Msk 0x0000FFFF

// EXTIMGSTARTADDR2 - This register contains the starting address of the validated extended software image 2.
#define AM_REG_INFO1_EXTIMGSTARTADDR2_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGSTARTADDR2_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGSTARTADDR2_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGSTARTADDR2_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGSTARTADDR2_ADDRESS_Msk 0xFFFFFFFF

