AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_mraminfo1.h
// EXTIMGENDADDR2 - This register contains the ending address of the validated extended software image 2.
#define AM_REG_INFO1_EXTIMGENDADDR2_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGENDADDR2_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGENDADDR2_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGENDADDR2_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGENDADDR2_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGTYPE3 - This register contains the type of the validated extended software image 3.
#define AM_REG_INFO1_EXTIMGTYPE3_CM4IMAGE_S 16
#define AM_REG_INFO1_EXTIMGTYPE3_CM4IMAGE_M 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE3_CM4IMAGE(n) (((uint32_t)(n) << 16) & 0x00010000)
#define AM_REG_INFO1_EXTIMGTYPE3_CM4IMAGE_Pos 16
#define AM_REG_INFO1_EXTIMGTYPE3_CM4IMAGE_Msk 0x00010000
#define AM_REG_INFO1_EXTIMGTYPE3_TYPE_S 8
#define AM_REG_INFO1_EXTIMGTYPE3_TYPE_M 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE3_TYPE(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO1_EXTIMGTYPE3_TYPE_Pos 8
#define AM_REG_INFO1_EXTIMGTYPE3_TYPE_Msk 0x0000FF00
#define AM_REG_INFO1_EXTIMGTYPE3_SUBTYPE_S 0
#define AM_REG_INFO1_EXTIMGTYPE3_SUBTYPE_M 0x000000FF
#define AM_REG_INFO1_EXTIMGTYPE3_SUBTYPE(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFO1_EXTIMGTYPE3_SUBTYPE_Pos 0
#define AM_REG_INFO1_EXTIMGTYPE3_SUBTYPE_Msk 0x000000FF

// EXTIMGVERSION3 - Version number of the installed software image 3.
#define AM_REG_INFO1_EXTIMGVERSION3_VERMAJOR_S 24
#define AM_REG_INFO1_EXTIMGVERSION3_VERMAJOR_M 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION3_VERMAJOR(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO1_EXTIMGVERSION3_VERMAJOR_Pos 24
#define AM_REG_INFO1_EXTIMGVERSION3_VERMAJOR_Msk 0xFF000000
#define AM_REG_INFO1_EXTIMGVERSION3_VERMINOR_S 16
#define AM_REG_INFO1_EXTIMGVERSION3_VERMINOR_M 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION3_VERMINOR(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO1_EXTIMGVERSION3_VERMINOR_Pos 16
#define AM_REG_INFO1_EXTIMGVERSION3_VERMINOR_Msk 0x00FF0000
#define AM_REG_INFO1_EXTIMGVERSION3_VERBLD_S 0
#define AM_REG_INFO1_EXTIMGVERSION3_VERBLD_M 0x0000FFFF
#define AM_REG_INFO1_EXTIMGVERSION3_VERBLD(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_INFO1_EXTIMGVERSION3_VERBLD_Pos 0
#define AM_REG_INFO1_EXTIMGVERSION3_VERBLD_Msk 0x0000FFFF

// EXTIMGSTARTADDR3 - This register contains the starting address of the validated extended software image 2.
#define AM_REG_INFO1_EXTIMGSTARTADDR3_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGSTARTADDR3_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGSTARTADDR3_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGSTARTADDR3_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGSTARTADDR3_ADDRESS_Msk 0xFFFFFFFF

// EXTIMGENDADDR3 - This register contains the ending address of the validated extended software image 3.
#define AM_REG_INFO1_EXTIMGENDADDR3_ADDRESS_S 0
#define AM_REG_INFO1_EXTIMGENDADDR3_ADDRESS_M 0xFFFFFFFF
#define AM_REG_INFO1_EXTIMGENDADDR3_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_EXTIMGENDADDR3_ADDRESS_Pos 0
#define AM_REG_INFO1_EXTIMGENDADDR3_ADDRESS_Msk 0xFFFFFFFF

// POWERSTATE0 - ICY_TX_TOP_PA_LINEARIZE_LUT_0_Coef_14
#define AM_REG_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_S 5
#define AM_REG_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_M 0x000003E0
#define AM_REG_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS(n) (((uint32_t)(n) << 5) & 0x000003E0)
#define AM_REG_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_Pos 5
#define AM_REG_INFO1_POWERSTATE0_VDDFRXCOMPTRIMMINUS_Msk 0x000003E0
#define AM_REG_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_S 0
#define AM_REG_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_M 0x0000001F
#define AM_REG_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS(n) (((uint32_t)(n) << 0) & 0x0000001F)
#define AM_REG_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_Pos 0
#define AM_REG_INFO1_POWERSTATE0_VDDCRXCOMPTRIMMINUS_Msk 0x0000001F

// SCM_CNTRCTRL2 - SCM controller control 2
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT2_S 16
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT2_M 0xFFFF0000
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT2(n) (((uint32_t)(n) << 16) & 0xFFFF0000)
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT2_Pos 16
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT2_Msk 0xFFFF0000
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT1_S 0
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT1_M 0x0000FFFF
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT1(n) (((uint32_t)(n) << 0) & 0x0000FFFF)
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT1_Pos 0
#define AM_REG_INFO1_SCM_CNTRCTRL2_FCNT1_Msk 0x0000FFFF

// SCM_LPTHRESHVDDS - SCM low power VDDS threshold
#define AM_REG_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_S 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_M 0x000FFFFF
#define AM_REG_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_Pos 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDS_LPTHRESHVDDS_Msk 0x000FFFFF

// SCM_LPTHRESHVDDF - SCM low power VDDF threshold
#define AM_REG_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_S 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_M 0x000FFFFF
#define AM_REG_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_Pos 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDF_LPTHRESHVDDF_Msk 0x000FFFFF

// SCM_LPTHRESHVDDC - SCM low power VDDC threshold
#define AM_REG_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_S 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_M 0x000FFFFF
#define AM_REG_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_Pos 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDC_LPTHRESHVDDC_Msk 0x000FFFFF

// SCM_LPTHRESHVDDCLV - SCM low power VDDCLV threshold
#define AM_REG_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_S 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_M 0x000FFFFF
#define AM_REG_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_Pos 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_Msk 0x000FFFFF

// SCM_LPTHRESHVDDRF - SCM low power VDDRF threshold
#define AM_REG_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_S 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_M 0x000FFFFF
#define AM_REG_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF(n) (((uint32_t)(n) << 0) & 0x000FFFFF)
#define AM_REG_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_Pos 0
#define AM_REG_INFO1_SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_Msk 0x000FFFFF

